Repository: Conectivo/eea.facetednavigation
Catalog: eea/facetednavigation/locales/*/LC_MESSAGES/plone.po
Languages: ro

source: Disable faceted navigation
ro: Dezactivare navigare faţetată

source: Enable faceted navigation
ro: Activare navigare faţetată

source: Faceted criteria
ro: Criteriu faţetat

source: Object provides
ro: Obiectul prevede

source: Portal type
ro: Tip portal

source: Sort on
ro: Sortare pe

source: Sync faceted translations
ro: Sincronizare traduceri faţetate

source: label_schema_countable
ro: Numarabil

source: label_schema_display
ro: Afişare

source: label_schema_geometry
ro: Geometrie

source: label_schema_layout
ro: Aspect
